Revit 2027 API
StairsRun.BaseElevation Property
 The base elevation of the stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BaseElevation { get; set; }
Public Property BaseElevation As Double
	Get
	Set
public:
property double BaseElevation {
	double get ();
	void set (double value);
}
member BaseElevation : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for baseElevation must be no more than 30000 feet in absolute value. -or- When setting this property: The baseElevation doesn't meet the restriction that bottom of run should not be lower than bottom of stairs. -or- When setting this property: The baseElevation doesn't meet the minimal height restriction of the stairs run. -or- When setting this property: The baseElevation impacts the top elevation which is less than extension below base.
Remarks
 The base elevation has following restrictions:
The base elevation is relative to the base elevation of the stairs to which the stairs run belongs.
When setting this property the value will be rounded automatically to a multiple of the riser height.
When setting this property for common run, the run's height will change according to the new base/top elevation. So the value must be less than the top elevation to keep run valid.
When setting this property for sketched run, whose height is fixed, the run's top elevation will be adjusted to keep the same run height.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace